package LessonVariables;

public class LessonVariables {
    public static void main(String[] args) {

        // Данный урок будет про примитивные типы данных, о том, какие данные бывают,
        // как они записываются в java и некоторые возможности работы с ними. Все что мы
        // изучим на данном уроке, это основы, которые знать обязательно, и сложного ничего нет,
        // вы будите встречаться с разными типами данных, в каждой создаваемой вами программе,
        // поэтому запомнить материал не составит труда.

        // Примитивные типы данных - это основа языка java, это фундамент. Всего в языке java существует 8 примитивных типов данных

        // Примитивные типы данных можно разделить на 3 категории, давайте их рассмотрим:

        // (Перейти в презентацию)

        // 1. Целые числа - byte, short, char, int, long
        // 2. Числа с плавающей точкой(иначе говоря дробные числа) - float, double
        // 3. Логический тип данных - boolean

        // Над примитивными типами данных можно совершать всеми знакомые математические операции

        // Объявим три переменные типа инт, тип данных инт наверное самый популярный в java языке среди примитивных переменных
        // все потому что он позволяет хранить в себе большой диапазон значений, и имеет размер всего 32 бита.

        // итак
        int a = 10;
        int b = 2;

        int c;


        // Далее можно продемонстрируем возможные операции с переменными
        c = a + b;      // 12
        c = a - b;      // 8
        c = a * b;      // 20
        c = a / b;      // 5
        c = a % b;      // 0



    }
}
